document.getElementById("binaryCalc").onclick = function() {
    document.getElementById("answer").value = "Двоичния калкулатор работи като въведете двоично число и чрез бутона конвертирай, го превръща в десетично число, като имате предвид че двоичните числа съдържат само 0 и 1.";
}
document.getElementById("standartCalc").onclick = function() {
    document.getElementById("answer").value = "Стандартния калкулатор извършва 5 вида операции между две числа и те са: събиране, изваждане , умножение, деление и степенуване като въвеждате първото число след това оператор(въвежда се по този начин: +, -, *, /, ^; другия начин с имена на кирила или латиница примерно вместо + може да въведете плюс) и след това второто число.";
}